ì´ í”„ë¡œì íŠ¸ëŠ” Cisco Packet Tracerë¥¼ í™œìš©í•˜ì—¬ VLANì„ êµ¬ì„±í•˜ê³ , ì„œë¡œ ë‹¤ë¥¸ VLAN ê°„ í†µì‹ ì„ ê°€ëŠ¥í•˜ê²Œ í•˜ëŠ” í† í´ë¡œì§€ë¥¼ êµ¬ì¶•í•œ ì˜ˆì œ
ì„œë²„ì™€ ì—¬ëŸ¬ ê°œì˜ PCê°€ ê°ê° ë‹¤ë¥¸ VLANì— ì†í•´ ìˆìœ¼ë©°, ë¼ìš°í„°ì˜ ì„œë¸Œ ì¸í„°í˜ì´ìŠ¤(ROAS, Router on a Stick)ë¥¼ í†µí•´ VLAN ê°„ ë¼ìš°íŒ…ì„ ì§€ì›í•¨

<ë„¤íŠ¸ì›Œí¬ í† í´ë¡œì§€>

ì„œë²„ (Server-PT) â†’ VLAN 100

PC1 â†’ VLAN 10

PC2 â†’ VLAN 20

PC3 â†’ VLAN 30

ìŠ¤ìœ„ì¹˜(2960-24TT) â†’ VLAN ë³„ í¬íŠ¸ í• ë‹¹

ë©€í‹°ë ˆì´ì–´(3650-24PS) â†’ Switch 1,2,3 ë‹´ë‹¹

âš™ï¸ VLAN ë° IP êµ¬ì„±
VLAN ì •ë³´
VLAN ë²ˆí˜¸	ì´ë¦„	í• ë‹¹ ì¥ë¹„
VLAN 10	Sales	PC1
VLAN 20	HR	PC2
VLAN 30	Marketing	PC3
VLAN 100	ServerNet	Server
<IP ì£¼ì†Œ ì²´ê³„>
ì¥ë¹„	ì¸í„°í˜ì´ìŠ¤	VLAN	IP ì£¼ì†Œ	ê²Œì´íŠ¸ì›¨ì´
PC1	Fa0	10	192.168.10.10	192.168.10.1
PC2	Fa0	20	192.168.20.10	192.168.20.1
PC3	Fa0	30	192.168.30.10	192.168.30.1
Server	Fa0	100	192.168.100.10	192.168.100.1
Router	G0/1.10	10	192.168.10.1	-
Router	G0/1.20	20	192.168.20.1	-
Router	G0/1.30	30	192.168.30.1	-
Router	G0/1.100	100	192.168.100.1	-
<ë¼ìš°í„° ì„¤ì • (ROAS)>
Router> enable
Router# configure terminal
Router(config)# interface gig0/1
Router(config-if)# no shutdown

<VLAN 10>
Router(config)# interface gig0/1.10
Router(config-subif)# encapsulation dot1Q 10
Router(config-subif)# ip address 192.168.10.1 255.255.255.0

<VLAN 20>
Router(config)# interface gig0/1.20
Router(config-subif)# encapsulation dot1Q 20
Router(config-subif)# ip address 192.168.20.1 255.255.255.0

<VLAN 30>
Router(config)# interface gig0/1.30
Router(config-subif)# encapsulation dot1Q 30
Router(config-subif)# ip address 192.168.30.1 255.255.255.0

! VLAN 100
Router(config)# interface gig0/1.100
Router(config-subif)# encapsulation dot1Q 100
Router(config-subif)# ip address 192.168.100.1 255.255.255.0

ğŸ”§ ìŠ¤ìœ„ì¹˜ ì„¤ì •
Switch> enable
Switch# configure terminal

<VLAN ìƒì„±>
Switch(config)# vlan 10
Switch(config-vlan)# name Sales
Switch(config)# vlan 20
Switch(config-vlan)# name HR
Switch(config)# vlan 30
Switch(config-vlan)# name Marketing
Switch(config)# vlan 100
Switch(config-vlan)# name ServerNet

<í¬íŠ¸ í• ë‹¹>
Switch(config)# interface fa0/1
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 10

Switch(config)# interface fa0/2
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 20

Switch(config)# interface fa0/3
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 30

Switch(config)# interface gig0/1
Switch(config-if)# switchport mode trunk

<í†µì‹  í…ŒìŠ¤íŠ¸>

ê° PCì—ì„œ ê²Œì´íŠ¸ì›¨ì´ë¡œ Ping â†’ ì •ìƒ í†µì‹  í™•ì¸

ping 192.168.10.1


PC1 â†” PC2, PC3, Server ê°„ ìƒí˜¸ Ping í…ŒìŠ¤íŠ¸

ping 192.168.20.10
ping 192.168.30.10
ping 192.168.100.10


ëª¨ë“  ì¥ë¹„ ê°„ í†µì‹  ê°€ëŠ¥í•˜ë©´ VLAN ë¼ìš°íŒ…ì´ ì •ìƒì ìœ¼ë¡œ ë™ì‘.

<íŒŒì¼ êµ¬ì¡°>
/My-VLAN-Proeject
 â”œâ”€â”€ topology.png   # íŒ¨í‚· íŠ¸ë ˆì´ì„œ í† í´ë¡œì§€ ìº¡ì²˜
 â”œâ”€â”€ VLAN.pkt       # Packet Tracer í”„ë¡œì íŠ¸ íŒŒì¼
 â””â”€â”€ README.md      # ì„¤ëª… ë¬¸ì„œ

<í•™ìŠµ í¬ì¸íŠ¸>

VLAN ë¶„í•  ë° ê´€ë¦¬ ë°©ë²•

Access / Trunk í¬íŠ¸ ì„¤ì •

Router-on-a-Stick(ROAS) ê°œë…

VLAN ê°„ ë¼ìš°íŒ… ë° í†µì‹  í…ŒìŠ¤íŠ¸
